PX4/PX4-Autopilot/nuttx/arch/arm/src/kinetis/kinetis_enet.h
/********************************************************************************************
 * arch/arm/src/kinetis/kinetis_enet.h
 *
 *   Copyright (C) 2011 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <spudmonkey@racsa.co.cr>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ********************************************************************************************/

#ifndef __ARCH_ARM_SRC_KINETIS_KINETIS_ENET_H
#define __ARCH_ARM_SRC_KINETIS_KINETIS_ENET_H

/********************************************************************************************
 * Included Files
 ********************************************************************************************/

#include <nuttx/config.h>

#include "chip.h"

#if defined(KINETIS_NENET) &&  KINETIS_NENET > 0

/********************************************************************************************
 * Pre-processor Definitions
 ********************************************************************************************/

/* Register Offsets *************************************************************************/

#define KINETIS_ENET_EIR_OFFSET      0x0004 /* Interrupt Event Register */
#define KINETIS_ENET_EIMR_OFFSET     0x0008 /* Interrupt Mask Register */
#define KINETIS_ENET_RDAR_OFFSET     0x0010 /* Receive Descriptor Active Register */
#define KINETIS_ENET_TDAR_OFFSET     0x0014 /* Transmit Descriptor Active Register */
#define KINETIS_ENET_ECR_OFFSET      0x0024 /* Ethernet Control Register */
#define KINETIS_ENET_MMFR_OFFSET     0x0040 /* MII Management Frame Register */
#define KINETIS_ENET_MSCR_OFFSET     0x0044 /* MII Speed Control Register */
#define KINETIS_ENET_MIBC_OFFSET     0x0064 /* MIB Control Register */
#define KINETIS_ENET_RCR_OFFSET      0x0084 /* Receive Control Register */
#define KINETIS_ENET_TCR_OFFSET      0x00c4 /* Transmit Control Register */
#define KINETIS_ENET_PALR_OFFSET     0x00e4 /* Physical Address Lower Register */
#define KINETIS_ENET_PAUR_OFFSET     0x00e8 /* Physical Address Upper Register */
#define KINETIS_ENET_OPD_OFFSET      0x00ec /* Opcode/Pause Duration Register */
#define KINETIS_ENET_IAUR_OFFSET     0x0118 /* Descriptor Individual Upper Address Register */
#define KINETIS_ENET_IALR_OFFSET     0x011c /* Descriptor Individual Lower Address Register */
#define KINETIS_ENET_GAUR_OFFSET     0x0120 /* Descriptor Group Upper Address Register */
#define KINETIS_ENET_GALR_OFFSET     0x0124 /* Descriptor Group Lower Address Register */
#define KINETIS_ENET_TFWR_OFFSET     0x0144 /* Transmit FIFO Watermark Register */
#define KINETIS_ENET_RDSR_OFFSET     0x0180 /* Receive Descriptor Ring Start Register */
#define KINETIS_ENET_TDSR_OFFSET     0x0184 /* Transmit Buffer Descriptor Ring Start Register */
#define KINETIS_ENET_MRBR_OFFSET     0x0188 /* Maximum Receive Buffer Size Register */
#define KINETIS_ENET_RSFL_OFFSET     0x0190 /* Receive FIFO Section Full Threshold */
#define KINETIS_ENET_RSEM_OFFSET     0x0194 /* Receive FIFO Section Empty Threshold */
#define KINETIS_ENET_RAEM_OFFSET     0x0198 /* Receive FIFO Almost Empty Threshold */
#define KINETIS_ENET_RAFL_OFFSET     0x019c /* Receive FIFO Almost Full Threshold */
#define KINETIS_ENET_TSEM_OFFSET     0x01a0 /* Transmit FIFO Section Empty Threshold */
#define KINETIS_ENET_TAEM_OFFSET     0x01a4 /* Transmit FIFO Almost Empty Threshold */
#define KINETIS_ENET_TAFL_OFFSET     0x01a8 /* Transmit FIFO Almost Full Threshold */
#define KINETIS_ENET_TIPG_OFFSET     0x01ac /* Transmit Inter-Packet Gap */
#define KINETIS_ENET_FTRL_OFFSET     0x01b0 /* Frame Truncation Length */
#define KINETIS_ENET_TACC_OFFSET     0x01c0 /* Transmit Accelerator Function Configuration */
#define KINETIS_ENET_RACC_OFFSET     0x01c4 /* Receive Accelerator Function Configuration */

#define KINETIS_ENET_ATCR_OFFSET     0x0400 /* Timer Control Register */
#define KINETIS_ENET_ATVR_OFFSET     0x0404 /* Timer Value Register */
#define KINETIS_ENET_ATOFF_OFFSET    0x0408 /* Timer Offset Register */
#define KINETIS_ENET_ATPER_OFFSET    0x040c /* Timer Period Register */
#define KINETIS_ENET_ATCOR_OFFSET    0x0410 /* Timer Correction Register */
#define KINETIS_ENET_ATINC_OFFSET    0x0414 /* Time-Stamping Clock Period Register */
#define KINETIS_ENET_ATSTMP_OFFSET   0x0418 /* Timestamp of Last Transmitted Frame */

#define KINETIS_ENET_TGSR_OFFSET     0x0604 /* Timer Global Status Register */
#define KINETIS_ENET_TCSR0_OFFSET    0x0608 /* Timer Control Status Register */
#define KINETIS_ENET_TCCR0_OFFSET    0x060c /* Timer Compare Capture Register */
#define KINETIS_ENET_TCSR1_OFFSET    0x0610 /* Timer Control Status Register */
#define KINETIS_ENET_TCCR1_OFFSET    0x0614 /* Timer Compare Capture Register */
#define KINETIS_ENET_TCSR2_OFFSET    0x0618 /* Timer Control Status Register */
#define KINETIS_ENET_TCCR2_OFFSET    0x061c /* Timer Compare Capture Register */
#define KINETIS_ENET_TCSR3_OFFSET    0x0620 /* Timer Control Status Register */
#define KINETIS_ENET_TCCR3_OFFSET    0x0624 /* Timer Compare Capture Register */

