PX4/PX4-Autopilot/nuttx/arch/arm/src/kinetis/kinetis_enet.h
#  define RXDESC_BDU                 (1 << 7)
#endif

/********************************************************************************************
 * Public Types
 ********************************************************************************************/
/* Buffer Descriptors ***********************************************************************/
/* Legacy Buffer Descriptor */

#ifdef CONFIG_ENET_ENHANCEDBD
struct enet_desc_s
{
  uint16_t status1;     /* Control and status */
  uint16_t length;      /* Data length */
  uint8_t  *data;       /* Buffer address */
  uint32_t status2;     /* Extended status */
  uint16_t lenproto;    /* Header length + Protocol type */
  uint16_t checksum;    /* Payload checksum */
  uint32_t bdu;         /* BDU */
  uint32_t timestamp;   /* Time stamp */
  uint32_t reserved1;   /* unused */
  uint32_t reserved2;   /* unused */
}
#else
struct enet_desc_s
{
  uint16_t status1;     /* Control and status */
  uint16_t length;      /* Data length */
  uint8_t  *data;       /* Buffer address */
};
#endif

/********************************************************************************************
 * Public Data
 ********************************************************************************************/

/********************************************************************************************
 * Public Functions
 ********************************************************************************************/

#endif /* KINETIS_NENET &&  KINETIS_NENET > 0 */
#endif /* __ARCH_ARM_SRC_KINETIS_KINETIS_ENET_H */
